[{
  "position": [822, 839],
  "type": "conflict",
  "header": "The Trouble with Kumar",
  "content": {
    "situationImage": "images/conflict/kumar-0a.png",
    "sequence": [{
      "type": "caption",
      "text": "As you’re taking a round in the warehouse in the morning, Dev approaches you with a complaint against his team mate, Kumar"
    }, {
      "type": "speech",
      "text": "Kumar and I are scheduled for the same warehouse shift.",
      "balloonClass": "balloon-69"
    }, {
      "type": "speech",
      "text": "He regularly plays games on his cell phone while I pick the orders.",
      "situationImage": "images/conflict/kumar-0b.png"
      }, {
      "type": "speech",
      "text": "I have to do the bulk of the work while he plays.",
      "situationImage": "images/conflict/kumar-0a.png"
      }, {
      "type": "speech",
      "text": "I've asked him on four different occasions to help me, but he doesn't listen to me."
    }],
    "situationBalloonClass": "balloon-44",
    "description": "You’ve already reprimanded Kumar in the past about his slack behaviour. What kind of disciplinary action should you take against him now?",
    "situationSpeech": "Kumar and I are scheduled for the same warehouse shift. Kumar regularly plays games on his cell phone while I take inventory. I have to do the bulk of the work while he plays. I've asked him on four different occasions to help me, but he doesn't listen to me.",
    "bannerImg": "images/ui/banner/fire.jpg",
    "options": [
      "Send Kumar a notification of termination",
      "Scold Kumar in front of his team mates",
      "Set strict productivity targets for Kumar"
    ],
    "reactions": [{
      "confirmText": "Are you sure you want to terminate Kumar without giving him a chance to take responsibility?",
      "correct": false,
      "text": "You’ve fired Kumar without allowing him a chance to take responsibility. This has negatively affected the morale of the employees. Workers feel that your response was disproportionate to Kumar’s offence and now feel discouraged and worried about their own job security.",
      "situationImage": "images/conflict/kumar-1.png"
    }, {
      "confirmText": "Are you sure you want to embarrass Kumar like that?",
      "correct": false,
      "text": "You gave Kumar a dressing down in front of others. He resents you now as he has become a laughing stock for a group of warehouse workers. He wants to quit and his friends are not happy about how things panned out either.",
      "situationImage": "images/conflict/kumar-2.svg"
    }, {
      "confirmText": "Are you sure you want to give Kumar a second chance?",
      "correct": true,
      "text": "You did the right thing by giving Kumar a chance to take responsibility and become more professional. You made him and—by extension—others in the team feel supported and laid the ground for cultivating a more trusting relationship with the employees.",
      "situationImage": "images/conflict/kumar-3.svg"
    }]
  }
}]


