[{
  "position": [822, 839],
  "type": "conflict",
  "header": "The Trouble with Kumar",
  "content": {
    "situationImage": "images/conflict/kumar-0a.png",
    "sequence": [{
      "type": "caption",
      "text": "As you’re taking a round in the warehouse in the morning, Dev approaches you with a complaint against his team mate, Kumar"
    }, {
      "type": "speech",
      "text": "Kumar and I are scheduled for the same warehouse shift.",
      "balloonClass": "balloon-69"
    }, {
      "type": "speech",
      "text": "He regularly plays games on his cell phone while I pick the orders.",
      "situationImage": "images/conflict/kumar-0b.png"
      }, {
      "type": "speech",
      "text": "I have to do the bulk of the work while he plays.",
      "situationImage": "images/conflict/kumar-0a.png"
      }, {
      "type": "speech",
      "text": "I've asked him on four different occasions to help me, but he doesn't listen to me."
    }],
    "situationBalloonClass": "balloon-44",
    "description": "After establishing the complaint to be true and giving Kumar a warning, what kind of disciplinary action should you take against Kumar if his behaviour persists?",
    "situationSpeech": "Kumar and I are scheduled for the same warehouse shift. Kumar regularly plays games on his cell phone while I take inventory. I have to do the bulk of the work while he plays. I've asked him on four different occasions to help me, but he doesn't listen to me.",
    "bannerImg": "images/ui/banner/fire.jpg",
    "options": [
      "Send Kumar a notification of termination as he is hampering warehouse productivity",
      "Reprimand Kumar in the morning meeting so as to discourage others from behaving this way too",
      "Have Kumar report his productivity numbers to you or a team leader at the end of every shift"
    ],
    "reactions": [{
      "confirmText": "Are you sure you want to terminate Kumar without giving him a chance to take responsibility?",
      "correct": false,
      "text": "You picked the wrong choice. You chose to send Kumar a notification of termination without giving him a chance to change his behaviour. In such a situation, you should try to engage the employee in a meaningful conversation about his behaviour and allow him to take responsibility. In his way you will be able to cultivate a more trusting relationship with the employee in which he feels supported. ",
      "situationImage": "images/conflict/kumar-1.png"
    }, {
      "confirmText": "Are you sure you want to embarrass Kumar like that?",
      "correct": false,
      "text": "You picked the wrong choice. You chose to reprimand Kumar in front of other employees in a morning meeting. In such a situation you should try to engage the employee in a meaningful private conversation about his behaviour and allow him to take responsibility. Reprimanding an employee publicly will lower the chances of affecting change or building trust in the employees. ",
      "situationImage": "images/conflict/kumar-2.svg"
    }, {
      "confirmText": "Are you sure you want to give Kumar a second chance?",
      "correct": true,
      "text": "You picked the right choice. You chose to have Kumar report his productivity numbers to you or a team leader at the end of every shift. In this way you allowed the employee a chance to take responsibility and become more professional. ",
      "situationImage": "images/conflict/kumar-3.svg"
    }]
  }
}]


